In [18]:
import numpy as np
import pandas as pd

In [19]:
data=pd.DataFrame([[1,2,3,4],[2,3,4,5],[4,5,8,9],[1,7,6,8]])
data

   0  1  2  3
0  1  2  3  4
1  2  3  4  5
2  4  5  8  9
3  1  7  6  8

In [20]:
df=pd.DataFrame(data)
df

   0  1  2  3
0  1  2  3  4
1  2  3  4  5
2  4  5  8  9
3  1  7  6  8

In [21]:
df.columns=['Random Value 1','Random Value 2','Random Value 3','Random Value 4']
df

   Random Value 1  Random Value 2  Random Value 3  Random Value 4
0               1               2               3               4
1               2               3               4               5
2               4               5               8               9
3               1               7               6               8

In [22]:
### Descriptive values of DataFrame

In [23]:
df.shape

(4, 4)

In [24]:
df.describe()

       Random Value 1  Random Value 2  Random Value 3  Random Value 4
count        4.000000        4.000000        4.000000        4.000000
mean         2.000000        4.250000        5.250000        6.500000
std          1.414214        2.217356        2.217356        2.380476
min          1.000000        2.000000        3.000000        4.000000
25%          1.000000        2.750000        3.750000        4.750000
50%          1.500000        4.000000        5.000000        6.500000
75%          2.500000        5.500000        6.500000        8.250000
max          4.000000        7.000000        8.000000        9.000000

In [25]:
df.isnull().sum()

Random Value 1    0
Random Value 2    0
Random Value 3    0
Random Value 4    0
dtype: int64

In [26]:
df.dtypes

Random Value 1    int64
Random Value 2    int64
Random Value 3    int64
Random Value 4    int64
dtype: object

In [27]:
selec_col=df.loc[:,['Random Value 2','Random Value 3']]
selec_col

   Random Value 2  Random Value 3
0               2               3
1               3               4
2               5               8
3               7               6

In [28]:
selec_col_1=df.iloc[:,[1,2]]
selec_col_1

   Random Value 2  Random Value 3
0               2               3
1               3               4
2               5               8
3               7               6